//Kasetsart university insect detect function
//because we are knowladge of the land
//faculty of education and developing science

const line = require('@line/bot-sdk')
const express = require('express')
const axios = require('axios').default
const dotenv = require('dotenv')
const fs = require('fs');
const path = require('path');
const util = require('util')
const env = dotenv.config().parsed
const app = express()
const { pipeline } = require('stream')
const lineConfig = {
    channelAccessToken: env.ACCESS_TOKEN,
    channelSecret: env.SECRET_TOKEN
}
var pestdata
var found

const ku = 
[
    '  ku80ku80ku80ku80ku80ku80ku80ku80',
    '  ku80ku80ku80ku80ku80ku80ku80ku80',
    '  ku80  80ku80  80ku  ku80ku  ku80',
    '  ku80  80ku80  80ku  ku80ku  ku80',
    '  ku80  80ku  ku80ku  ku80ku  ku80',
    '  ku80  80  80ku80ku  ku80ku  ku80',
    '  ku80    ku80ku80ku  ku80ku  ku80',
    '  ku80  80  80ku80ku  ku80ku  ku80',
    '  ku80  80ku  ku80ku  ku80ku  ku80',
    '  ku80  80ku80  80ku  ku80ku  ku80',
    '  ku80  80ku80  80ku          ku80',
    '  ku80ku80ku80ku80ku80ku80ku80ku80',
    '  ku80ku80ku80ku80ku80ku80ku80ku80',
    '  ku80                        ku80',
    '  ku80ku80ku80ku80ku80ku80ku80ku80',
    '  ku80ku80ku80ku80ku80ku80ku80ku80',
    '                                ',
    'knowladgeoftheland-kasetsartuniversity',
    'facultyofeducationanddevelopingscience'
]

console.log(ku)
function sleep(ms) {
    return new Promise((resolve) => setTimeout(resolve, ms));
  }

const client = new line.Client(lineConfig);

app.post('/webhook', line.middleware(lineConfig), async (req, res) => {
    try {
        const events = req.body.events;
        console.log('event =>>>>', events);
        return events.length > 0 ? await events.map(item => handleEvent(item)) : res.status(200).send('OK')
    } catch (error) {
        console.log(error);
        res.status(500).end();
    }
})


const handleEvent = async (event) =>{
    console.log(event)
    if (event.message.type === 'image') {
        if (event.message.contentProvider.type === 'line'){
            const dlpath = path.join(__dirname,'download',`${event.message.id}.jpg`)
            const filename = `${event.message.id}.jpg`
            await downloadcontent(event.message.id,dlpath)
            console.log('download compleat',filename)
            const axios = require("axios");
            const fs = require("fs");
            const image = fs.readFileSync(`/Users/papangkornd./Desktop/line/download/${filename}`, {
            encoding: "base64"
            });
            axios({
            method: "POST",
            url: "https://detect.roboflow.com/kusk-ai-pest-detect-2n8qu/1",
            params: {
            api_key: "CGkvMBYIdlGU5SYnHagv"
            },
            data: image,
            headers: {
            "Content-Type": "application/x-www-form-urlencoded"
            }
            })
            .then(function(response) {
            pestdata = response.data
            console.log(response.data);
            })
            .catch(function(error) {
            console.log(error.message);
            });
            
            await sleep(5000);
            console.log(pestdata)

            if ((pestdata.predictions.length == 0)){
                return client.replyMessage(event.replyToken,{type:'text',text:'ไม่มีพบแมลงในภาพดังกล่าว'})
            }else{
                var name = pestdata.predictions[0].class
                if (name === 'predators'){
                    found = 'คือ แมลงตัวห้ำ ซึ่งมาหลายชนิด เป็นแมลงที่มีประโยชน์ต่อเกษตรกร ปกติแล้ว หากินเหยื่อที่เป็นแมลงด้วยกันเป็นอาหาร บางชนิดเป็นแมลงตัวห้ำทั้งในระยะที่เป็นตัวอ่อนและตัวเต็มวัย  จะออกหากินเหยื่อโดยการกัดกินตัวเหยื่อ หรือ การดูดกินของเหลวในตัวเหยื่อ โดยแมลงตัวหำ้นั้นสามารถช่วยกำจัดแมลงศัตรูพืชได้ ข้อมูลเพิ่มเติม https://www.dnp.go.th/foremic/nforemic/Predator/index_Pred.htm'
                }else if (name === 'Bombay_locust'){
                    found = 'คือตั๊กแตนปาทังกา เป็นตั๊กแตนที่มีขนาดใหญ่ ตัวอ่อนจะมีสีเขียว เหลือง แต่เมื่อเป็นตัวแก่จะมีสีน้ำตาลอ่อนหรือสีน้ำตาลเข้ม  ลักษณะเด่นชัด คือ ที่แก้มทั้ง 2 ข้าง มีแถบสีดำ พาดจากขอบตารวมด้านล่างถึงปาก  ส่วนอกตรงกลางจะคอดเข้าเล็กน้อย  ด้านข้างอกทั้ง 2 ด้าน มีแถบสีน้ำตาลดำ พาดเป็นทางยาว ต่อไปยังปีกหน้าจนถึงปลายปีก 1-2 แถบ  ด้านหลังมีแถบสีเหลืองอ่อน พาดจากส่วนหัวจนถึงปลายปีก ปีกยาวคลุมปิดปลายปล้องท้อง   ตั๊กแตนปาทังกานั้นมักจะมีนิสัยที่จะกัดกินใบและต้นข้าว สามารถกำจัดได้โดยการใช้น้ำหมักสะเดา ตรวจสอบข้อมูลเพิ่มเติม https://tinyurl.com/3ukpcrm9'
                }else if (name === 'stink_bug'){
                    found = 'คือแมลงสิง เป็นแมลงมวนชนิดหนึ่ง มีอีกชื่อว่าแมลงฉง ตัวเต็มวัยมีรูปร่างเพรียวยาว ตัวด้านบนสีน้ำตาล ปล่อยกินเหม็นออกมาจากส่วนท้องได้ เมื่อเราสัมผัสหรืไปรบกวนมันจะบินหนี แลงสิงนั้นมักจะดูดกินเมล็ดข้าวทั้งเมล็ดอ่อนและเมล็ดแข็งโดยตัวเต็มวัยจะทำความเสียหายมากกว่า เพราะดูดกินเป็นเวลานานกว่าทำให้เมล็ดลีบ หรือเมล็ดไม่สมบูรณ์และผลผลิตข้าวลดลง การป้องกันกำจัด 1). กำจัดวัชพืชในนาข้าว คันนาและรอบๆแปลง 2).ใช้สวิงโฉบจับตัวอ่อนและตัวเต็มวัยในนาข้าวที่พบระบาดและนำมาทำลาย 3). ตัวเต็มวัยชอบกินเนื้อเน่า นำเนื้อเน่าแขวนไว้ตามนาข้าว และจับมาทำลาย 4). หลีกเลี่ยงการปลูกข้าวต่อเนื่องเพื่อลดการแพร่ขยายพันธุ์ ตรวจสอบข้อมูลเพิ่มเติมได้ที่ http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=56-1.htm'
                }else if (name === 'brown_planthopper'){
                    found = 'คือเพลี้ยกระโดดสีน้ำตาล ตัวเต็มวัยมีลำตัวสีน้ำตาลถึงสีน้ำตาลปนดำ ส่วนใหญ่วางไข่ที่กาบใบข้าว หรือเส้นกลางใบ โดยวางไข่เป็นกลุ่ม เรียงแถวตามแนวตั้งฉากกับกาบใบข้าว บริเวณที่วางไข่จะมีรอยช้ำเป็นสีน้ำตาล ไข่มีลักษณะรูปกระสวยโค้งคล้ายกล้วยหอม มีสีขาวขุ่น เพลี้ยกระโดดสีน้ำตาลนั้นมักจะดูดกินน้ำเลี้ยวต้นข้าว ทำให้ต้นข้าวมีอาการใบเหลืองแห้งเป็นหย่อม ๆ หรือใบไหม้ และเพลี้ยกระโดดสีน้ำตาลยังเป็นตัวนำเชื้อไวรัส โรคใบหงิก มาสู่ต้นข้าว ทำให้ต้นข้าวมีอาการแคระแกร็น ตรวจสอบข้อมูลเพิ่มเติมได้ที่  ในแหล่งที่มีการระบาด และควบคุมระดับน้ำในนาได้ หลังปักดำหรือหว่าน 2-3 สัปดาห์จนถึงระยะตั้งท้องควบคุมน้ำในแปลงนาให้พอดินเปียก หรือมีน้ำเรี่ยผิวดินนาน 7-10 วัน แล้วปล่อยขังทิ้งไว้ให้แห้งเองสลับกันไป จะช่วยลดการระบาดของเพลี้ยกระโดดสีน้ำตาล http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=46-1.htm'
                }else if (name === 'rice_leaffolder'){
                    found = 'คือหนอนห่อใบข้าว เต็มวัยเป็นผีเสื้อกลางคืนปีกสีน้ำตาลเหลืองมีแถบสีดำพาดที่ปลายปีก ตัวหนอนฟักออกมาจะแทะผิวใบข้าวส่วนที่เป็นสีเขียว ทำให้เห็นเป็นแถบยาวสีขาว มีผลให้การสังเคราะห์แสงลดลง หนอนจะใช้ใยเหนียวที่สกัดจากปาก ดึงขอบใบข้าวทั้งสองด้านเข้าหากันเพี่อห่อหุ้มตัวหนอนไว้หนอนจะทำลายใบข้าว ทุกระยะการเจริญเติบโตของข้าว ตรวจสอบข้อมูลเพิ่มเติม https://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=50-1.htm วิธีกำจัด สามารถใช้น้ำส้มควันไม้ได้ ในแหล่งที่มีการระบาด และควบคุมระดับน้ำในนาได้ หลังปักดำหรือหว่าน 2-3 สัปดาห์จนถึงระยะตั้งท้องควบคุมน้ำในแปลงนาให้พอดินเปียก หรือมีน้ำเรี่ยผิวดินนาน 7-10 วัน แล้วปล่อยขังทิ้งไว้ให้แห้งเองสลับกันไป จะช่วยลดการระบาดของเพลี้ยกระโดดสีน้ำตาล https://www3.rdi.ku.ac.th/?p=34938'
                }else if (name === 'Mealydug'){
                    found = 'คือเพลี้ยแป้ง มีลำตัวเป็นข้อ ปล้อง รูปร่างกลมหรือยาวรี ส่วนหัวและขาอยู่ใต้ลำตัว มี 6 ขา ไม่มีปีก มีผงแป้งคลุมตัว ปากเป็นแบบดูดกิน ขยายพันธุ์ได้ทั้งโดยการใช้เพศและไม่ใช้เพศ เพลี้ยแป้งนั้นมักจะดูดกินน้ำเลี้ยงของต้นข้าว ทำให้ต้นข้าวใบเหลืองจนแห้งตายทั้งกอ หากต้นข้าวที่ไม่ตายออกรวงมาจะทำให้ข้าวมีเมล็ดลีบ ตรวจสอบข้อมูลเพิ่มเติมได้ที่ http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=49-1.htm สามารถกำจัดได้โดย การใช้น้ำหมักสะเดา http://www.pmc06.doae.go.th/pdf%20file%20pmc%20knowledge/Azadirechtine.pdf'
                }else if (name === 'yellow_stem_borer'){
                    found = 'คือหนอนกอข้าวสีครีม ตัวหนอนสีขาวหรือครีม หัวสีน้ำตาลแกมเหลือง ลำตัวยาว หัวท้ายเรียวแหลม มี 6 ระยะ และเข้าดักแด้ภายในลำตัวบริเวณข้อปล้องเหนือผิวน้ำ ทำให้กาบใบมีสีเหลืองหรือน้ำตาล ซึ่งจะเห็นเป็นอาการช้ำๆ เมื่อฉีกกาบใบดูจะพบตัวหนอน ตรวจข้อมูลเพิ่มเติม http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=44-1.htm อาจใช้บิวเวอร์เรียในการกำจัด http://www.pmc08.doae.go.th/beauveria.htm'
                }else if (name === 'rice_thrips'){
                    found = 'คือเพลี้ยไฟ เป็นเพลี้ยชนิดหนึง แมลงจำพวกปากดูด ขนาดเล็กลำตัวยาวประมาณ 1-2 มิลลิเมตร มีทั้งชนิดมีปีกและไม่มีปีก เพลี้ยไฟทั้งตัวอ่อนและตัวเต็มวัยจะทำลายข้าวโดยการดูดกินน้ำเลี้ยง จากใบข้าวที่ยังอ่อนโดยอาศัยอยู่ตามซอกใบ ระบาดในระยะกล้า เมื่อใบข้าวโตขึ้นใบที่ถูกทำลายปลายใบจะเหี่ยวขอบใบจะม้วนเข้าหากลางใบ ข้อมูลเพิ่มเติม http://www.ricethailand.go.th/rkb3/Insect.htm  ใช้บิวเวอร์เรีย และน้ำส้มควันไม้ในการกำจัด http://www.pmc08.doae.go.th/beauveria.htm  https://www3.rdi.ku.ac.th/?p=34938'
                }else if (name === 'Scarab_Beetle'){
                    found = 'อาจจะเป็น มวนง่าม ด้วงดำ หรือแมลงหล่า เนื่องจากมีลักษณะที่คล้ายกัน มวนง่ามเคลื่อนที่ช้าและชอบเกาะนิ่งอยู่ตามส่วนต่างๆของต้นข้าวทำลายข้าวโดยดูดกินน้ำเลี้ยงจากลำต้นและใบ มวนง่ามมีปากแบบเจาะดูด มี Stylet พับอยู่ใต้ส่วนหัว มวนง่ามทุกวัยสามารถทำลายข้าวโดยใช้ Stylet เจาะลงไปในใบและลำต้นข้าวแล้วดูดกินน้ำเลี้ยง จากส่วนต่างๆ ของต้นข้าว ทำให้ลำต้นและใบเหี่ยวเฉา นอกจากนี้ตัวเต็มวัยซึ่งมีขนาดใหญ่ เมื่อไปเกาะตามลำต้นและใบ เป็นจำนวนมาก สามารถทำให้ลำต้น และใบในระยะกล้าและหลังปักดำใหม่หักพับเสียหายมากด้วงดำ เป็นแมลงจำพวกด้วงปีกแข็งชนิดหนึ่งซึ่งเป็นศัตรูที่สำคัญของการปลูกข้าว โดยวิธีหว่านข้าวแห้งในภาคตะวันออกเฉียงเหนือ เมื่อถอนต้นข้าวขึ้นมารากข้าวจะหลุดทำให้เข้าใจว่าด้วงชนิดนี้ทำลายรากข้าว ด้วย แต่ ถ้าใช้วิธีขุดต้นข้าวที่แสดงอาการใบเหลือง เหี่ยว จะพบว่ารากข้าวไม่ถูกกัดกินแต่อย่างไร ด้วงดำจะเคลื่อนย้ายทำลายข้าวต้นอื่นๆโดยการทำโพรงอยู่ใต้ดินในระดับใต้ราก ข้าวทำให้เห็นรอยขุยดินเป็นแนว ส่วนใหญ่มักพบตัวเต็มวัยของด้วงดำชนิดนี้ 1 ตัวต่อจุดที่ขุดสำรวจ และพบไข่มีลักษณะกลมสีขาวขุ่นขนาดเท่าเม็ดสาคูขนาดเล็ก 5-6 ฟอง แมลงหล่า เป็นมวนชนิดหนึ่ง มีลักษณะค่อนข้างกลมคล้ายโล่ห์ ด้านหัวและอกเป็นรูปสามเหลี่ยม ลำตัวมีสีน้ำตาลหรือดำเป็นมันวาว ตัวอ่อนและตัวเต็มวัยดูดกินน้ำเลี้ยงจากกาบใบข้าวบริเวณโคนต้นข้าว ทำให้บริเวณที่ถูกทำลายเป็นสีน้ำตาลแดงหรือเหลือง การป้องกันกำจัดแมลงหล่า 1) ใช้แสงไฟฟ้าล่อแมลงและทำลายในช่วงที่มีการระบาด 2) ปลูกข้าวที่มีอายุเก็บเกี่ยวสั้นเพื่อลดการเพิ่มประชากรในนาข้าว 3 ) กำจัดวัชพืชที่ขึ้นหนาแน่นในนาข้าวการป้องกันกำจัดด้วงดำ 1.ควรหว่านข้าวตามฤดูกาล (สิงหาคม) ไม่ควรหว่านช่วงระหว่างปลายเมษายนถึงต้นมิถุนายน 2. ล่อและทำลายตัวเต็มวัยของด้วงดำ โดยใช้หลอดไฟชนิดแบล็กไลท์ที่เกษตรกรในภาคตะวันออกเฉียงเหนือนิยมใช้ล่อแมลงดานา 3. สำรวจนาข้าวเมื่อพบตัวเต็มวัยด้วงดำในกับดักแสงไฟปริมาณมากกว่าปกติการป้องกันกำจัดมวนง่าม 1). เก็บกลุ่มไข่ทำลาย 2). ใช้สวิงโฉบจับตัวอ่อนและตัวเต็มวัยไปทำลาย ข้อมูลเพิ่มเติม http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=40-1.htm http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=53-1.htm http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=55-1.htm '
                }else if (name === 'red_cucurbit_leaf_beetle'){
                    found = 'คือ ด้วงเต่าแตง เป็นแมลงปีกแข็งสีแดงแสด จะมีสีของลำตัว 2 สี คือ ชนิดสีดำ และเต่าแตงชนิดสีแดง เคลื่อนไหวช้า กัดกินใบพืช กินเป็นวง ๆ กัดที่โคนต้นพืช จึงทำให้พืชเป็นแผล ข้อมูลเพิ่มเติม https://tinyurl.com/y5masx94  กำจัดโดยการใช้กากกาแฟ หรือน้ำส้มควันไม้ ในการขับไล่ https://kasetgo.com/t/topic/41278 https://www3.rdi.ku.ac.th/?p=34938'
                }else if (name === 'human'){
                    found = 'คือมนุษย์ มนุษย์เป็นสัตว์สายพันธุ์หนึ่งที่อยู่ในกลุ่มสัตว์เลี้ยงลูกด้วยนม  มนุษย์เป็นสัตว์ที่มีความสามารถในการคิด แสดงอารมณ์ และมีการสื่อสารด้วยภาษา รวมถึงสามารถสร้างเครื่องมือและเทคโนโลยีต่าง ๆ เพื่อชีวิตอยู่ร่วมกับสิ่งแวดล้อมได้อย่างหลากหลาย มนุษย์มีลักษณะพิเศษ คือ มีสมองใหญ่เมื่อเทียบกับขนาดตัว โดยเฉพาะสมองชั้นนอก สมองส่วนหน้า และสมองกลีบขมับที่พัฒนาเป็นอย่างดี ข้อมูลเพิ่มเติม https://tinyurl.com/3xfzbfns'
                }else if (name === 'rice_gall_midge'){
                    found = 'คือแมลงบั่ว มีลักษณะคล้ายยุงหรือริ้น  ตัวหนอนคล้ายหนอนแมลงวัน ส่วนใหญ่ระบาดในภาคเหนือตอนบนหรือภาคตะวันออกเฉียงเหนือ (ภาคอีสาน) ตัวหนอนที่ฟักจากไข่จะคลานตามบริเวณกาบใบเพื่อแทรกตัวเข้าไปในกาบใบ เข้าไปอาศัยกัดกินที่จุดกำเนิดของหน่ออ่อน ทำลายยอดข้าวทำให้ข้าวไม่สามารถออกรวงได้ ทำให้ต้นข้าวและกอข้าวแคระแกรน ในระยะที่ข้าวแตกกอจะเป็นระยะแมลงบั่วนั้นจะทำลายหรืระบาดมาก พบมากในช่วงฤดูฝน ตรวจสอบข้อมูลได้ที่ http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=45-1.htm สามารถกำจัดได้โดยการกำจัดวัชพืชบริเวณนา ไม่ควรใช้ยาฆ่าแมลง เนื่องจากไม่สามารถทำลายแมลงบั่วได้'
                }else if (name === 'Golden_apple_snail'){
                    found = 'คือหอยเชอรี่ หอยโข่งอเมริกาใต้ หรือ หอยเป๋าฮื้อน้ำจืด กินข้าวอ่อนจนถึงระยะข้าวแตกกอ โดยจะเริ่มต้นเข้ากัดกินต้นกล้าข้าวใต้น้ำเหนือจากพื้นดิน 1- 2 นิ้ว แล้วจึงกัดกินส่วนใบที่อยู่เหนือน้ำจนหมด วิธีการกำจัด อาจจะใช้เป็นกากชา หรือ กากกาแฟโรยบริเวณนาข้าว https://kasetgo.com/t/topic/41278 หรือจุดที่มีหอยเชอร์รี่อาศัยอยู่ได้ตรวจสอบข้อมูลเพิ่มเติมได้ที่ https://tinyurl.com/ueekauek'
                }else if (name === 'Mite'){
                    found = 'คือตัวไร มีขนาดเล็กสามารถมองเห็นไรขาวได้โดยการมองผ่านกล้องจุลทรรศน์ เป็นศัตรูพืชชีวภาพอย่างหนึ่ง มักพบระบาดหนักในฤดูฝนช่วงเดือนกรกฎาคมถึงกันยายน ทำให้เกิดการหยุดเจริญในพืช วิธีการป้องกันและกำจัด ตรวจดูไรขาวบนใบพืชตั้งแต่เริ่มปลูกอย่างสม่ำเสมอ ถ้าเริ่มตรวจพบให้รีบกำจัดโดยการใช้สารฆ่าเฉพาะไร อาจเป็นสารสกัดจากพืช  หรือศัตรูทางชีวภาพของไรขาวเช่นไรตัวห้ำ'
                }else if (name === 'caterpillar'){
                    found = 'คือหนอนบุ้ง บุ้ง เป็นระยะตัวอ่อนของผีเสื้อ ตามลำตัวจะมีขนคัน โดยที่ปลายขนจะมีลักษณะเป็นหนามแหลม ตรงกลางเป็นท่อกลวง ซึ่งขนของบุ้งจะมีพิษ เป็นอันตรายต่อมนุษย์ โดยน้ำพิษจะถูกหลั่งออกมาเมื่อถูกสัมผัส เป็นศัตรูพืชของต้นหม่อนเนื่องจากมักพบกินใบของต้นหม่อน สามารถใช้ น้ำที่สกัดจาก ยาสูบ ตะไคร้หอม ขมิ้นชัน ผกากรอง สะเดา ในการฉีดพ่นเพื่อไล่หนอนบุ้งได้ ข้อมูลเพิ่มเติม https://www.scimath.org/article-science/item/9100-2018-10-18-08-32-45 https://www.baanlaesuan.com/109057/plant-scoop/larva_butterfly '
                }else if (name === 'rice_black_bug'){
                    found = 'ตัวอ่อนและตัวเต็มวัยดูดกินน้ำเลี้ยงจากกาบใบข้าวบริเวณโคนต้นข้าว ทำให้บริเวณที่ถูกทำลายเป็นสีน้ำตาลแดงหรือเหลือง ขอบใบข้าวเปลี่ยนเป็นสีน้ำตาลดำคล้ายข้าวเป็นโรคไหม้ ตามข้อของลำต้นข้าวเป็นบริเวณที่แมลงหล่าชอบเพราะเป็นแหล่งที่มีน้ำเลี้ยง ทำให้กอข้าวแคระแกร็น วิธีการกำจัดใช้แสงไฟฟ้าล่อแมลงและทำลายในช่วงที่มีการระบาด เนื่องจากแมลงหล่าชอบบินมาเล่นแสงไฟเวลากลางคืน https://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=55-1.htm'
                }else if (name === 'rice_root_weevil'){
                    found = 'คือด้วงงวงกินรากข้าว ตัวเต็มวัยมีสีน้ำตาลดำ ระบาดในบางพื้นที่  ด้านหัวมีส่วนโค้งยื่นออกมา ตัวหนอนที่ฟักออกมาจะกัดกินบริเวณรากข้าว หนอนมีสีขาว และเข้าดักแด้จนกระทั่งเป็นตัวเต็มวัย ทำลายข้าวโดยตัวหนอนกัดกินรากข้าว ทำให้ต้นข้าวเหี่ยวและแห้งตาย เนื่องจากรากข้าวถูกหนอนกัดกินจนหมด ตรวจสอบข้อมูลเพิ่มเติมได้ที่ http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=54-1.htm การป้องกันและกำจัด กำจัดวัชพืชรอบแปลงนา การปล่อยน้ำเข้านา'
                }else if (name === 'rice_hispa'){
                    found = 'คือแมลงดำหนาม หนอนกัดกินภายในใบข้าว คล้ายหนอนชอนใบ ตัวเต็มวัยกัดกินผิวใบข้าวด้านบน ทำให้เกิดเป็นรอยขูดเป็นทางสีขาวยาวขนานกับเส้นกลางใบของใบข้าว ตรวจสอบข้อมูลเพิ่มเติมได้ที่ http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=52.htm อาจจะแก้โดยการไม่ใช้ปุ๋ยไนโตรเจนมากเกินไป'
                }else if (name === 'zigzag_leafhopper'){
                    found = 'คือเพลี้ยจักจั่นปีกลายหยัก ปีกสองข้างมีลายหยักสีน้ำตาลเป็นทาง ทั้งตัวอ่อนและตัวเต็มวัยดูดกินน้ำเลี้ยงจากใบและกาบใบข้าว ข้าวที่ถูกทำลายปลายใบจะแห้งและขอบใบเปลี่ยนเป็นสีส้ม ต่อมาข้าวทั้งใบจะ เป็นสีส้มและขอบใบหงิกงอ อาการของโรคจะปรากฏที่ใบแก่ก่อน นอกจากนี้ยังเป็นพาหะนำโรคใบสีส้ม ตรวจสอบข้อมูลเพิ่มเติมได้ที่http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=48-1.htm อาจจะใช้แสงไฟเพื่อล่อแมลง'
                }else if (name === 'green_rice_leafhopper'){
                    found = 'คือเพลี้ยจักจั่น เพลี้ยจักจั่นสีเขียวเป็นแมลงจำพวกปากดูด ที่พบทำลายข้าวในประเทศไทย มี2ชนิด ตัวเต็มวัยของแมลงทั้ง 2 ชนิดมีสีเขียวอ่อนและอาจมีแต้มดำบนหัวหรือปีก ขนาดลำตัวยาว ตัวเต็มวัยไม่มีชนิดปีกสั้น เคลื่อนย้ายรวดเร็วเมื่อถูกรบกวน  สามารถบินได้เป็นระยะทางไกลหลายกิโลเมตร  ชอบบินมาเล่นไฟตอนกลางคืน ข้อมูลเพิ่มเติม http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=47.htm การป้องกันกำจัด 1). ใช้แสงไฟล่อแมลงและทำลายเมื่อมีการระบาดรุนแรง 2). ปลูกข้าวพร้อม ๆ กัน และปล่อยพื้นนาว่างไว้ระยะหนึ่ง เพื่อตัดวงจรชีวิตของแมลง'
                }else if (name === 'rice_ear-cutting'){
                    found = 'คือ หนอนกระทู้คอรวง หนอนกระทู้คอรวงมีอีกชื่อคือ หนอนกระทู้ควายพระอินทร์ ตัวเต็มวัยเป็นผีเสื้อกลางคืน ปีกคู่หน้าสีน้ำตาลอ่อน แทรกสีน้ำตาลแดง ชอบกัดกินส่วนคอรวงหรือระแง้ของรวงข้าวที่กำลังจะสุก ทำให้คอรวงขาด หนอนจะกัดกินต้นข้าวทุกวันจนกระทั่งเข้าดักแด้ พบระบาดมากหลังน้ำท่วมหรือฝนตกหนัก หลังผ่านช่วงแล้งที่ยาวนานแล้วตามด้วยฝนตกหนัก การทำลายจะเสียหายรุนแรง ตรวจสอบข้อมูลเพิ่มเติมได้ที่ https://www.ricethailand.go.thrkb3/title-index.php-file=content.php&id=58-1.htm อาจกำจัดได้โดยการกำจัดวัชพืชบริเวณนา'
                }else if (name === 'fly'){
                    found = 'คือแมลงวัน เป็นแมลงที่อาศัยอยู่กับชุมชนมนุษย์ชนิดหนึ่ง ส่วนมากคนจะรู้จักบางชนิด มักจะกินอาหารที่เป็นเนื้อสัตว์และเศษอาหาร ตามกองขยะ และชอบหากินเวลากลางวัน อาจใช้กาวดักแมลงวัน แต่แมลงวันไม่ได้ถือเป็นแมลงศัตรูพืช ตรวจสอบข้อมูลเพิ่มเติมได้ที่ https://www.cheminpestcontrol.com/products/product-36'
                }else if (name === 'ant'){
                    found = 'คือมด มดเป็นสัตว์สังคมในกลุ่มแมลง ซึ่งเป็นสัตว์เล็ก ๆ มดมีลักษณะก้านตัวแบ่งออกเป็นส่วนๆ ประกอบด้วยศอก ลำตัวและสะโพก มดมีเปลือกแข็งที่เรียกว่าเกราะ ซึ่งช่วยปกป้องส่วนของตัวมดและให้ความแข็งแรง แต่มดไม่ได้เป็นศัตรูพืช ซึ่งไม่ได้มีการทำลายต้นพืช ตรวจสอบข้อมูลเพิ่มเติมได้ที่ https://www.cheminpestcontrol.com/blogs/ant/infoant'
                }else if (name === 'cockroach'){
                    found = 'คือแมลงสาบ มีลักษณะลำตัวยาวรีเป็นรูปไข่ เป็นสีดำหรือสีน้ำตาลเข้ม มีส่วนหัวซ่อนอยู่ใต้อก มีหนวดยาวคล้ายเส้นด้าย ส่วนขายาวมีหนามคลุม ตัวเต็มวัยมีทั้ง มีปีกและไม่มีปีก เป็นแมลงที่หากินตามพื้นดินเป็นหลักตามที่มืด ๆ หรือในเวลากลางคืน ไม่ชอบที่จะบิน และวิ่งได้เร็วมาก ไม่เป็นศัตรูพืช หรือกล่าวได้ว่าแมลงสาบไม่ได้ทำอันตรายต่อพืช ตรวจสอบข้อมูลเพิ่มเติมได้ที่ https://www.one-step.co.th/?p=29'
                }else if (name === 'Long-horned_Grasshopper'){
                    found = 'คือ ตั๊กแตนหนวดยาว  ลักษณะเด่นมีหนวดยาวกว่าลำตัว หัวและอกสีเขียว ฟีเมอร์ของขาคู่หลังขยายใหญ่มีสีเขียว ส่วนปลายที่ติดกับทิเบียจะเรียวเล็ก ทิเบียมีหนามสีดำ ปีกหน้าสีเขียวปนน้ำตาล เป็นตัวห้ำกินไข่ผีเสื้อหนอนกอ ตัวอ่อนของเพลี้ยกระโดดและเพลี้ยจักจั่น ช่วยกำจัดศัตรูพืช ตรวจสอบข้อมูลเพิ่มเติมได้ที่ https://tinyurl.com/3fjc3r9v'
                }else if (name === 'ladybug'){
                    found = 'คือเต่าทอง จัดเป็นแมลงขนาดเล็กเมื่อเทียบกับแมลงปีกแข็งทั่วไป  ลำตัวอ้วนกลม ส่วนใหญ่ที่พบในประเทศไทย มักมีปีกสีแดง ส้ม เหลือง และมักจะแต้มด้วยสีดำเป็นจุด ไม่ได้เป็นศัตรูพืชแต่กำจัด(กิน)ศัตรูพืชตามธรรมชาติ (เป็นตัวห้ำ) https://oer.learn.in.th/search_detail/result/261694'
                }else if (name === 'spider'){
                    found = 'คือแมงมุม จัดเป็นสิ่งมีชีวิตพวกสัตว์ขาปล้อง มี 8 ขา แมงมุมมีลำตัวเพียงสองส่วนเท่านั้น  และส่วนที่เป็นลำตัวประกอบไปด้วยส่วนหัวและส่วนอกเชื่อมติดต่อกัน ส่วนหลังเรียกว่าส่วนท้อง แมงมุมจะไม่มีปีก ไม่ได้เป็นศัตรูพืชแต่มีส่วนในการกำจัดศัตรูพืชตามธรรมชาติ ตรวจสอบข้อมูลเพิ่มเติมได้ที่ https://tinyurl.com/4dwzaddx'
                }else if (name === 'dragonfly'){
                    found = 'คือแมลงปอ มีจุดเด่น คือ มีส่วนหัวที่กลมโตใหญ่ มีดวงตาขนาดใหญ่ 2 ดวงอยู่ด้านข้าง แมลงปอ มีขากรรไกรล่างที่แข็งแรง แหลมคม มีขนาดใหญ่ โฉบจับแมลงต่าง ๆ กินเป็นอาหาร ไม่ใช่ศัตรูพืช ตรวจสอบข้อมูลเพิ่มเติมได้ที่ http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=86-1.htm'
                }else if (name === 'long-horned_cicada'){
                    found = 'คือ จักจั่นหนวดยาว เป็นแมลงที่มีตาขนาดใหญ่ อยู่ด้านข้างของหัว มีประสาทการรับรู้ที่ดีอยู่บนปีก ดูดกินน้ำเลี้ยงจากพืชเป็นอาหาร ซึ่งมีหนวดยาวและมีรูปร่างที่สวยงาม เป็นแมลงที่มีขนาดใหญ่มากถึง 2-6 เซนติเมตร และมีหนวดยาวอันหนาที่เรียกว่า "หนวดกราด" ซึ่งเป็นเอกลักษณ์ที่แตกต่างจากแมลงส่วนใหญ่ ส่วนใหญ่จักจั่นหนวดยาวมีเปลือกแข็งและเป็นเพลียวเรียว โดยมีสีและลวดลายที่หลากหลาย ข้อมูลเพิ่มเติม https://tinyurl.com/ah7kbbvy ใช้บิวเวอร์เรียกำจัด http://www.pmc08.doae.go.th/beauveria.htm'
                }else if (name === 'Bugs'){
                    found = 'คือมวน มวนดูดไข่มีสีน้ำตาล ปีกหน้าสีน้ำตาลอ่อนตลอดทั้งปีก เป็นตัวห้ำทำลายไข่เพลี้ยกระโดดและเพลี้ยจักจั่น มีอีกชนิดคล้าย ๆ กันคือ มวนเขียวดูดไข่มีสีเขียวหนวด หัว และอกสีดำ เพศผู้โคนปีกหน้าสีเขียว ปลายปีกสีเทาหรือดำอ่อน เป็นตัวห้ำดูดกินไข่เพลี้ยกระโดดสีน้ำตาลและเพลี้ยจักจั่นทำให้ไข่แฟบ มวนตัวห้ำนี้เป็นศัตรูธรรมชาติของเพลี้ยกระโดดสีน้ำตาล ตรวจสอบข้อมูลมวนดูดไข่ได้ที่ http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=74-1.htm ตรวจสอบข้อมูลมวนเขียวดูดไข่ได้ที่ http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=73-1.htm'
                }else if (name === 'Colliuris_pensylvanica'){
                    found = 'คือด้วงดิน  ตัวเต็มวัยยาวประมาณ 7-8 มิลลิเมตร หนวดยาว ปลายหนวดมีสีน้ำตาลดำเข้ม อกส่วนหน้ายาวกลมลักษณะคล้ายคอ มีสีน้ำตาลแดง  ด้วงดินเป็นตัวห้ำของตัวอ่อนและตัวเต็มวัยของเพลี้ยกระโดดและเพลี้ยจักจั่น หนอนและดักแด้ของผีเสื้อกินใบ  ไข่ผีเสื้อหนอน  หนอนและดักแด้แมลงบั่ว ดังนั้นจึงช่วยกำจัดแมลงศัตรูพืชได้ ตรวจสอบข้อมูลเพิ่มเติมได้ที่ http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=78-1.htm'
                }else if (name === 'Habrobracon_hebetor'){
                    found = 'คือแตนเบียนหนอน ตัวเต็มวัยมีขนาดยาวประมาณ 8 มิลลิเมตร สีน้ำตาลดำ ส่วนปล้องท้องมีสีน้ำตาลแดง มีสีน้ำตาลดำแถบพาดขวางเป็นช่วงๆ  เป็นแตนเบียนของหนอนกอแถบลาย  หนอนกอสีครีม และหนอนห่อใบข้าว ช่วยลดปริมาณของศัตรูพืช ตรวจสอบข้อมูลเพิ่มเติมได้ที่ http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=65-1.htm'
                }else if (name === 'Paederus_dermatitis'){
                    found = 'คือด้วงก้นกระดก เป็นด้วงขนาดเล็ก โคนหนวดสีน้ำตาลแดง ส่วนปลายสีน้ำตาลดำ มีขนตามปล้องหนวด หัวแบนสีดำ อกหน้าแบนยาว สีน้ำตาลไหม้ ปีกมีสีดำ ปีกสีน้ำเงินเข้มเป็นแมลงที่มีอายุอยู่ได้ยาวนาน มีความว่องไว ไต่ไปตามต้นข้าว และบินได้ ช่วยควบคุมการระบาดของแมลงศัตรูพืช ตรวจสอบข้อมูลเพิ่มเติมได้ที่ http://www.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=77-1.htm ส่วนโทษ ของด้วงก้นกระดกคือ หากเราสัมผัสถูกพิษของมันเข้าอาจจะทำให้เกิดแผลพุพองได้ ตรวจสอบข้อมูลเพิ่เติมได้ที่ https://tinyurl.com/2s4j7rf6'
                }else if (name === 'rice_seedling_armyworm'){
                    found = 'คือ หนอนกระทู้กล้า แมลงที่ใช้ปากกัด และทำลายต้นข้าวในระยะที่เป็นตัวหนอนเท่านั้น ตัวแก่ของมันมีลักษณะคล้ายผีเสื้อ ตัวหนอนจะเข้าทำลายต้นกล้า โดยใช้ปากกัดกินใบตรวจสอบข้อมูลเพิ่มเติมได้ที่ https://web.ku.ac.th/nk40/nk/data/03/lab1k62.htm วิธีการกำจัด เอาต้นหญ้า หรือฟางข้าวมากองไว้บนคันนา เพื่อล่อให้ตัวหนอนเข้าไปอาศัยในเวลากลางวัน ในเวลาบ่ายให้เก็บเอาตัวหนอนออกมาทำลาย หรืออาจใช้น้ำส้มควันไม้ https://www3.rdi.ku.ac.th/?p=34938'
                }else if (name === 'Mantis'){
                    found = 'คือ ตั๊กแตนตำข้าว ตัวเมียมีขนาดที่ตัวใหญ่กว่าตัวผู้ มีลำตัวสีเขียว หรือสีน้ำตาล มีอกปล้องแรกยาว มีลักษณะท่าทีชอบยืนขยับตัวขึ้นลง ๆ เนื่องจากมีขาคู่หน้าที่พัฒนาให้กลายเป็นขาหนีบใช้สำหรับจับเหยื่อ เวลาเมื่อไม่ได้ใช้งาน มักจะยกขึ้นประกบกันอยู่ที่ด้านหน้า เป็นแมลงที่ควบคุมศัตรูพืช แมลงชนิดนี้มีรูปร่างค่อนข้างยาวและมีหนวดยาวสองอันที่ยื่นออกมาจากหัว ตรวจสอบข้อมูลเพิ่มเติมได้ที่ https://www.jardineriaon.com/mantis-religiosa.html'
                }else{
                    found = 'Answer is over paramiter Error code : Thanakool'
                }
                return client.replyMessage(event.replyToken,{type:'text',text: found})
            }
        }return client.replyMessage(event.replyToken,{type:'text',text:'ตรวจพบปัญหาจากระบบเซิฟเวอร์'})
    }else{
        return client.replyMessage(event.replyToken,{type:'text',text:'ไม่พบรูปภาพ'})
    }
}

async function downloadcontent(mid, downloadpath){
    const stream  = await client.getMessageContent(mid)
    const piplineSync = util.promisify(pipeline)
    const folder_download = fs.createWriteStream(downloadpath)
    await piplineSync(stream,folder_download)
}

app.listen(4000, () =>{
    console.log('listening on 4000')
})